_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lambda_1 (Lambda)            (None, 70, 160, 3)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 33, 78, 24)        1824      
_________________________________________________________________
batch_normalization_1 (Batch (None, 33, 78, 24)        96        
_________________________________________________________________
activation_1 (Activation)    (None, 33, 78, 24)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 15, 37, 36)        21636     
_________________________________________________________________
batch_normalization_2 (Batch (None, 15, 37, 36)        144       
_________________________________________________________________
activation_2 (Activation)    (None, 15, 37, 36)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 6, 17, 48)         43248     
_________________________________________________________________
batch_normalization_3 (Batch (None, 6, 17, 48)         192       
_________________________________________________________________
activation_3 (Activation)    (None, 6, 17, 48)         0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 4, 15, 64)         27712     
_________________________________________________________________
batch_normalization_4 (Batch (None, 4, 15, 64)         256       
_________________________________________________________________
activation_4 (Activation)    (None, 4, 15, 64)         0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 2, 13, 64)         36928     
_________________________________________________________________
batch_normalization_5 (Batch (None, 2, 13, 64)         256       
_________________________________________________________________
activation_5 (Activation)    (None, 2, 13, 64)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 1664)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 100)               166500    
_________________________________________________________________
batch_normalization_6 (Batch (None, 100)               400       
_________________________________________________________________
activation_6 (Activation)    (None, 100)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 50)                5050      
_________________________________________________________________
batch_normalization_7 (Batch (None, 50)                200       
_________________________________________________________________
activation_7 (Activation)    (None, 50)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 10)                510       
_________________________________________________________________
batch_normalization_8 (Batch (None, 10)                40        
_________________________________________________________________
activation_8 (Activation)    (None, 10)                0         
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 11        
=================================================================
Total params: 305,003
Trainable params: 304,211
Non-trainable params: 792
_________________________________________________________________
